openfoam/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
148
(
10.0659
10.0659
10.0659
10.0659
10.0659
10.0659
10.0659
10.0659
...
)
;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
133
(
30.1978
30.1978
30.1978
30.1978
30.1978
30.1978
30.1978
30.1978
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
