openfoam/system/fvSolution
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object fvSolution;
}

solvers
{
  p
  {
    solver GAMG;
    tolerance 1e-06;
    relTol 1e-06;
    smoother GaussSeidel;
  }
  "(U|k|epsilon|omega|f|v2)"
  {
    solver smoothSolver;
    smoother symGaussSeidel;
    tolerance 1e-06;
    relTol 1e-06;
  }
}

SIMPLE
{
  nNonOrthogonalCorrectors 0;
  residualControl
  {
    p 0.001;
    U 1e-05;
    "(k|epsilon|omega|f|v2)" 1e-05;
  }
}

relaxationFactors
{
  fields
  {
    p 0.4;
  }
  equations
  {
    U 0.8;
    k 0.7; 	// 0.9 is more stable but 0.95 more convergent
    epsilon 0.7;
    ".*" 0.95; 	// 0.9 is more stable but 0.95 more convergent
  }
} 	// ************************************************************************* //

